Revit 2022 API
AnalyticalModel.SetApproximationDeviation Method
 Adjusts the amount by which approximation is made.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public void SetApproximationDeviation(
	double deviation
)
Visual Basic
Public Sub SetApproximationDeviation ( _
	deviation As Double _
)
Visual C++
public:
void SetApproximationDeviation(
	double deviation
)
Parameters
deviation
Type: System.Double
 Maximum distance from line to actual curve
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This AnalyticalModel does not support approximation.
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace